_software/ros.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-03 Fri 13:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ROS<sub>tafarian</sub> nation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="jacob" />
<link rel="stylesheet" type="text/css" href="../_css/solarized-dark.min.css" />


</head>
<body>
<div id="content">
<h1 class="title">ROS<sub>tafarian</sub> nation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcdfa012">1. Installation</a>
<ul>
<li><a href="#org25c28d3">1.1. Preliminary considerations</a></li>
<li><a href="#orgae82d3d">1.2. The Process (Melodic Morenia on ubuntu 18.04LTS)</a>
<ul>
<li><a href="#org01c24f7">1.2.1. set up the software sources for apt</a></li>
<li><a href="#orgf933294">1.2.2. install basic packages</a></li>
<li><a href="#org5311d75">1.2.3. initialize ros environment</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbceb8e0">2. Workspaces</a>
<ul>
<li>
<ul>
<li><a href="#orgc7bc6c7">2.0.1. Initialization</a>
<ul>
<li><a href="#org5bf9310">2.0.1.1. workspace structure</a></li>
</ul>
</li>
<li><a href="#orgaf3e868">2.0.2. Adding packages</a></li>
<li><a href="#orgb599068">2.0.3. </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgcdfa012" class="outline-2">
<h2 id="orgcdfa012"><span class="section-number-2">1</span> Installation</h2>
<div class="outline-text-2" id="text-1">
<p>
Installing ros is  a "relatively" painless process, the ros <a href="http://wiki.ros.org">website</a> 
has instructions, but we'll go through the process here.
</p>
</div>

<div id="outline-container-org25c28d3" class="outline-3">
<h3 id="org25c28d3"><span class="section-number-3">1.1</span> Preliminary considerations</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>you can chose a number of different operating systems, but ubuntu and debian
have the best support <i>by far</i></li>
<li>you need to <b>MAKE SURE</b> your <b>SUBVERSION</b> of ubuntu matches with the version of ROS
that you're installing. otherwise you'll have big issues installing things. As 
of this documents writing, you can't do ROS melodic on ubuntu 18.10 for exampe</li>
</ul>
</div>
</div>
<div id="outline-container-orgae82d3d" class="outline-3">
<h3 id="orgae82d3d"><span class="section-number-3">1.2</span> The Process (Melodic Morenia on ubuntu 18.04LTS)</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org01c24f7" class="outline-4">
<h4 id="org01c24f7"><span class="section-number-4">1.2.1</span> set up the software sources for apt</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-shell">sudo sh -c <span style="color: #2d9574;">'echo "deb http://packages.ros.org/ros/ubuntu $(</span><span style="color: #fa8072;">lsb_release</span><span style="color: #2d9574;"> -sc) main" &gt; /etc/apt/sources.list.d/ros-latest.list'</span>;
sudo apt-key adv --keyserver hkp://ha.pool.sks-keyservers.net:80 --recv-key <span style="color: #a45bad;">421C365BD9FF1F717815A3895523BAEEB01FA116</span>;
sudo apt update
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf933294" class="outline-4">
<h4 id="orgf933294"><span class="section-number-4">1.2.2</span> install basic packages</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>if you want gazebo install ros-&lt;dist&gt;-desktop-full</li>
<li>if you don't want gazebo bloat, ros-&lt;dist&gt;-desktop</li>
<li>if you're just using the packages from the software repo do ros-&lt;dist&gt;-ros-base</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">sudo apt-get install ros-melodic-desktop
</pre>
</div>
</div>
</div>
<div id="outline-container-org5311d75" class="outline-4">
<h4 id="org5311d75"><span class="section-number-4">1.2.3</span> initialize ros environment</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
ros packages rely on lots of symlinking &#x2013; =-( &#x2013; to work, so you need to do some setup work. 
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo rosdep init; 
rosdep update;
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">it is important that you don't use sudo for the update</span>

<span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"source /opt/ros/melodic/setup.bash"</span> &gt;&gt; ~/.bashrc;
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">depends on what your shell is, ros supports sh bash and zsh</span>
<span style="color: #4f97d7;">source</span> ~/.bashrc

sudo apt install python-rosinstall python-rosinstall-generator python-wstool build-essential
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">additional dependancies for building packages</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbceb8e0" class="outline-2">
<h2 id="orgbceb8e0"><span class="section-number-2">2</span> Workspaces</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc7bc6c7" class="outline-4">
<h4 id="orgc7bc6c7"><span class="section-number-4">2.0.1</span> Initialization</h4>
<div class="outline-text-4" id="text-2-0-1">
<p>
All of our ros code is organized functionally as a project within <i>catkin</i> workspaces.
Basically we need to organize our code this way so that ros can properly link all of the 
generated code it produces, and know where all the executables / launch files are
</p>

<p>
to make the workspace invoke
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7;">cd</span>;
mkdir -p catkin_ws/src
catkin_make 
<span style="color: #2aa1ae; background-color: #292e34;">## </span><span style="color: #2aa1ae; background-color: #292e34;">this is ROSs ugly mutant version of cmake </span>
</pre>
</div>
</div>

<div id="outline-container-org5bf9310" class="outline-5">
<h5 id="org5bf9310"><span class="section-number-5">2.0.1.1</span> workspace structure</h5>
<div class="outline-text-5" id="text-2-0-1-1">
<p>
you'll notice that  now we have two additional directories: devel and build.
</p>
</div>

<ol class="org-ol">
<li><a id="org9d9ca9c"></a>build<br />
<div class="outline-text-6" id="text-2-0-1-1-1">
<p>
build is our cmake build directory so it doesn't really have anything interesting
(that is unless you modify the cmake file to give you autocompletion).
</p>
</div>
</li>

<li><a id="orga9681d2"></a>devel<br />
<div class="outline-text-6" id="text-2-0-1-1-2">
<p>
on the other hand, devel contains <span class="underline"><i>all the code that ros generates from your packages</i></span> 
one of the features of ros is that you can communicate seamlessly between the nodes using a standard interface, that is why when you define your own "messages" and "services" ros generates code for them). 
</p>

<ul class="org-ul">
<li>If you want to see ros' prepackaged message and service defintions go to: 
<ul class="org-ul">
<li>/opt/ros/melodic/include for c++</li>
<li>and <i>opt/ros/melodic/lib/python2.7/dist-packages</i> for python.</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org72158dc"></a>src<br />
<div class="outline-text-6" id="text-2-0-1-1-3">
<p>
contains all your user defined packages
</p>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgaf3e868" class="outline-4">
<h4 id="orgaf3e868"><span class="section-number-4">2.0.2</span> Adding packages</h4>
<div class="outline-text-4" id="text-2-0-2">
<p>
Lets make our first catkin package =) 
</p>

<p>
first enter the src directory
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7;">cd</span> ~/catkin_ws/src
</pre>
</div>

<p>
to create a project from a template invoke \(\ldots\)
</p>
<div class="org-src-container">
<pre class="src src-sh">
catkin_create_pkg first_package rospy        std_msgs
<span style="color: #2aa1ae; background-color: #292e34;">#                 </span><span style="color: #2aa1ae; background-color: #292e34;">name of pkg   lang lib       additional packages </span>
</pre>
</div>

<p>
the most common language api's for ros are rospy and roscpp, albeit many others exist (matlab, java, lua , etc.)
most of the other packages give you message types : std\<sub>msgs</sub> , geometry\<sub>msgs</sub>, tf2 , etc. 
</p>
</div>
</div>






<div id="outline-container-orgb599068" class="outline-4">
<h4 id="orgb599068"><span class="section-number-4">2.0.3</span> </h4>
<div class="outline-text-4" id="text-2-0-3">
<div class="org-src-container">
<pre class="src src-shell">catkin_make  
</pre>
</div>
<p>
if you're compiling on a resource limited platform like a raspberry pi, it might be usefull
to use -j &lt;number of cores&gt; -l &lt;number of processes&gt; to prevent it from freezing up
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jacob</p>
<p class="date">Created: 2019-05-03 Fri 13:41</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
